mod3-c1/app/controllers/stores/orders_controller.rb

  def index
    @orders = current_store.orders
---
SELECT "orders".* FROM "orders"  WHERE "orders"."store_id" = ?  [["store_id", 3]]