mod3-c1/app/views/stores/orders/index.html.erb

<div class="container">
  <h3> <% current_store.orders.each do |order| %></h3>
---
SELECT "orders".* FROM "orders"  WHERE "orders"."store_id" = ?  [["store_id", 3]]