mod3-c1/app/views/stores/items/index.html.erb

  <h3>Welcome to <%= current_store.name %></h3>
  <% current_store.items.each do |item| %>
---
SELECT "items".* FROM "items"  WHERE "items"."store_id" = ?  [["store_id", 1]]